Revit 2024 API
BuiltInFailures.ConnectorFailures.InvalidPowerFactorValue Property
 The value for Power Factor must be between 0 and 1.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidPowerFactorValue { get; }
Visual Basic
Public Shared ReadOnly Property InvalidPowerFactorValue As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidPowerFactorValue {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace